nxp-mcuxpresso/mcux-soc-svd/LPC54S005/LPC54S005.xml
        <register>
          <name>AFSR</name>
          <description>Auxiliary Fault Status Register</description>
          <addressOffset>0xD3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUXFAULT</name>
              <description>Latched version of the AUXFAULT inputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPACR</name>
          <description>Coprocessor Access Control Register</description>
          <addressOffset>0xD88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CP10</name>
              <description>Access privileges for coprocessor 10.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP10_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP10_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP10_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP11</name>
              <description>Access privileges for coprocessor 11.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CP11_0</name>
                  <description>Access denied. Any attempted access generates a NOCP UsageFault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP11_1</name>
                  <description>Privileged access only. An unprivileged access generates a NOCP fault.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP11_3</name>
                  <description>Full access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCCR</name>
          <description>Floating-point Context Control Register</description>
          <addressOffset>0xF34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LSPACT</name>
              <description>Lazy state preservation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSPACT_0</name>
                  <description>Lazy state preservation is not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSPACT_1</name>
                  <description>Lazy state preservation is active. floating-point stack frame has been allocated but saving state to it has been deferred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER</name>
              <description>Privilege level when the floating-point stack frame was allocated.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USER_0</name>
                  <description>Privilege level was not user when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_1</name>
                  <description>Privilege level was user when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THREAD</name>
              <description>Mode when the floating-point stack frame was allocated.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THREAD_0</name>
                  <description>Mode was not Thread Mode when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREAD_1</name>
                  <description>Mode was Thread Mode when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFRDY</name>
              <description>Permission to set the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRDY_0</name>
                  <description>Priority did not permit setting the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRDY_1</name>
                  <description>Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMRDY</name>
              <description>Permission to set the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MMRDY_0</name>
                  <description>MemManage is disabled or priority did not permit setting the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMRDY_1</name>
                  <description>MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFRDY</name>
              <description>Permission to set the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFRDY_0</name>
                  <description>BusFault is disabled or priority did not permit setting the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFRDY_1</name>
                  <description>BusFault is disabled or priority did not permit setting the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONRDY</name>
              <description>Permission to set the MON_PEND when the floating-point stack frame was allocated.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MONRDY_0</name>
                  <description>DebugMonitor is disabled or priority did not permit setting MON_PEND when the floating-point stack frame was allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONRDY_1</name>
                  <description>DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSPEN</name>
              <description>Lazy state preservation for floating-point context.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSPEN_0</name>
                  <description>Disable automatic lazy state preservation for floating-point context.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSPEN_1</name>
                  <description>Enable automatic lazy state preservation for floating-point context.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASPEN</name>
              <description>Enables CONTROL2 setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASPEN_0</name>
                  <description>Disable CONTROL2 setting on execution of a floating-point instruction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASPEN_1</name>
                  <description>Enable CONTROL2 setting on execution of a floating-point instruction.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCAR</name>
          <description>Floating-point Context Address Register</description>
          <addressOffset>0xF38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>The location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSCR</name>
          <description>Floating-point Default Status Control Register</description>
          <addressOffset>0xF3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RMode</name>
              <description>Default value for FPSCR.RMode (Rounding Mode control field).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RMode_0</name>
                  <description>Round to Nearest (RN) mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMode_1</name>
                  <description>Round towards Plus Infinity (RP) mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMode_2</name>
                  <description>Round towards Minus Infinity (RM) mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMode_3</name>
                  <description>Round towards Zero (RZ) mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FZ</name>
              <description>Default value for FPSCR.FZ (Flush-to-zero mode control bit).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FZ_0</name>
                  <description>Flush-to-zero mode disabled. Behavior of the floating-point system is fully compliant with the IEEE 754 standard.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FZ_1</name>
                  <description>Flush-to-zero mode enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DN</name>
              <description>Default value for FPSCR.DN (Default NaN mode control bit).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DN_0</name>
                  <description>NaN operands propagate through to the output of a floating-point operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DN_1</name>
                  <description>Any operation involving one or more NaNs returns the Default NaN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHP</name>
              <description>Default value for FPSCR.AHP (Alternative half-precision control bit).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHP_0</name>
                  <description>IEEE half-precision format selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHP_1</name>
                  <description>Alternative half-precision format selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
